<?php
/**
 * 配置文件
 *
 * @author  ImDong (www@qs5.org)
 * @created 2021-01-07 17:39
 */

return [

    /*
    |--------------------------------------------------------------------------
    | 使用 REST API 时的域名
    |--------------------------------------------------------------------------
    |
    | 如果没有购买过 VIP 集群的用户，在使用 REST API 时域名请使用 a1.easemob.com
    | 如果不确认自己 AppKey 该使用哪个域名，可以提交工单找环信技术确认
    | 如果是 VIP 集群的用户，请联系对接的环信商务索要域名
    | 如果是使用环信客服系统中快速创建关联中的 AppKey，在使用 REST API 时域名请使用 a1-vip5.easemob.com
    | 对 http, https 都支持。
    |
    | 如果你不知道该使用哪个域名，请保持默认即可。
    */
    'api_domain' => env('EASEMOB_API_DOMAIN', 'https://a1.easemob.com'),

    /*
    |--------------------------------------------------------------------------
    | 唯一租户标识 (企业的唯一标识)
    |--------------------------------------------------------------------------
    |
    | 当您申请了 AppKey 后，会得到一个 xxx#xxxx 格式的字符串，org_name 对应为 AppKey 中 # 前面的部分
    */

    'org_name' => env('EASEMOB_ORG_NAME', ''),

    /*
    |--------------------------------------------------------------------------
    | APP 唯一标识
    |--------------------------------------------------------------------------
    |
    | 在环信后台创建一个 APP 时填写的应用 id 即是 app_name
    | 当您申请了 AppKey 后，会得到一个 xxx#xxxx 格式的字符串，app_name 对应为 AppKey 中 # 后面的部分
    */

    'app_name' => env('EASEMOB_APP_NAME', ''),

    /*
    |--------------------------------------------------------------------------
    | Client ID
    |--------------------------------------------------------------------------
    |
    | App 的 client_id，可在 [APP 详情页](https://console.easemob.com/app/detail) 找到
    */

    'client_id' => env('EASEMOB_CLIENT_ID', ''),

    /*
    |--------------------------------------------------------------------------
    | Client Secret (通讯密钥)
    |--------------------------------------------------------------------------
    |
    | App 的 client_secret，可在 [APP 详情页](https://console.easemob.com/app/detail) 找到
    */

    'client_secret' => env('EASEMOB_CLIENT_SECRET', ''),

    /*
    |--------------------------------------------------------------------------
    | 缓存 ClientToken 的 Cache Key
    |--------------------------------------------------------------------------
    |
    | 按照要求 ClientToken 有调用限制，需要缓存起来重复使用。
    */

    'cache_prefix' => env('EASEMOB_CACHE_PREFIX', 'Easemob'),

    /*
    |--------------------------------------------------------------------------
    | 缓存用户 Token
    |--------------------------------------------------------------------------
    |
    | 用以减少接口请求频率，单位 s 秒，设置为 -1 不缓存，设置为 0 则自动处理过期时间（过期前一天）
    */

    'cache_user_token' => env('EASEMOB_CACHE_USER_TOKEN', 0),
];
